In [1]:
import pandas as pd
import numpy as np

In [4]:
!ls

compare_tables.ipynb match_file.csv       source_data.json

In [6]:
csv_data = pd.read_csv('match_file.csv')
print(csv_data.shape)
csv_data.head(2)

(1265, 8)

,first_name,last_name,npi,street,street_2,city,state,zip
0,Ruthe,Laverne,44843147983186317848,569 glenda islands,suite 163,willport,nj,23453
1,Marshall,Cole,18233577393219566041,59944 adaline harbor,apt. 862,keelingstad,al,94189-5965

In [24]:
json_data = pd.read_json('source_data.json', lines=True)
print(json_data.shape)
json_data.head(2)

(11231, 2)

,doctor,practices
0,"{'first_name': 'Dean', 'last_name': 'Israel', ...","[{'lat': '-79.8757664338564', 'street': '271 A..."
1,"{'first_name': 'Quinton', 'last_name': 'Mollie...","[{'lat': '81.37417480720865', 'street': '8496 ..."

In [61]:
df1 = pd.io.json.json_normalize(json_data.to_dict('records'))
print(df1.shape)
df1.head(2)

(11231, 4)

,doctor.first_name,doctor.last_name,doctor.npi,practices
0,Dean,Israel,85103080143784778415,"[{'lat': '-79.8757664338564', 'street': '271 A..."
1,Quinton,Mollie,36233383542350521233,"[{'lat': '81.37417480720865', 'street': '8496 ..."

In [62]:
df2 = pd.io.json.json_normalize(df1.practices.apply(lambda x: x[0]).tolist())
print(df2.shape)
df2.head(2)

(11231, 7)

,city,lat,lon,state,street,street_2,zip
0,Port Demetris,-79.8757664338564,84.31253504872467,LA,271 Annabelle Fort,Apt. 404,53549
1,Nealville,81.37417480720865,-95.33450729432164,OR,8496 Kennedi Inlet,Suite 815,52665-6811

In [64]:
df1['city'] = df2.city
df1['lat'] = df2.lat
df1['lat'] = df2.lat
df1['state'] = df2.state
df1['street'] = df2.street
df1['street_2'] = df2.street_2
df1['zip'] = df2.zip
df1 = df1.drop(['practices'], 1).copy()
df1.head()

,doctor.first_name,doctor.last_name,doctor.npi,city,lat,state,street,street_2,zip
0,Dean,Israel,85103080143784778415,Port Demetris,-79.8757664338564,LA,271 Annabelle Fort,Apt. 404,53549
1,Quinton,Mollie,36233383542350521233,Nealville,81.37417480720865,OR,8496 Kennedi Inlet,Suite 815,52665-6811
2,Vincent,Abbie,68951826121607537145,West Lonnieberg,52.12502086274685,GA,210 Walsh Island,Suite 839,59104
3,Gerardo,Piper,92442805782715742535,Grantborough,78.53231427000821,MN,1262 O'Keefe Ford,Apt. 790,39283
4,Dean,Francesco,83029151715578341587,New Fredy,-4.541598251928605,IL,98764 Mante Trafficway,Suite 356,43570

In [76]:
df1['unique_id'] = df1['doctor.first_name'] +'_' + df1['doctor.last_name'] + '_' + df1['doctor.npi']
df1.head(2)

,doctor.first_name,doctor.last_name,doctor.npi,city,lat,state,street,street_2,zip,unique_id
0,Dean,Israel,85103080143784778415,Port Demetris,-79.8757664338564,LA,271 Annabelle Fort,Apt. 404,53549,Dean_Israel_85103080143784778415
1,Quinton,Mollie,36233383542350521233,Nealville,81.37417480720865,OR,8496 Kennedi Inlet,Suite 815,52665-6811,Quinton_Mollie_36233383542350521233

In [78]:
csv_data['unique_id'] = csv_data['first_name'] +'_' + csv_data['last_name'] + '_' + csv_data['npi']

In [80]:
csv_data.shape

(1265, 9)

In [82]:
merged_df = pd.merge(csv_data, df1, on=['unique_id'], how='left')
print(merged_df.shape)
merged_df.head(2)

(864, 18)

,first_name,last_name,npi,street_x,street_2_x,city_x,state_x,zip_x,unique_id,doctor.first_name,doctor.last_name,doctor.npi,city_y,lat,state_y,street_y,street_2_y,zip_y
0,Marshall,Cole,18233577393219566041,59944 adaline harbor,apt. 862,keelingstad,al,94189-5965,Marshall_Cole_18233577393219566041,Marshall,Cole,18233577393219566041,Lake Sheila,67.8952178905721,AZ,729 Reuben Stream,Apt. 314,85355
1,Lawson,Lilliana,78792788275411915642,36175 amina mount,apt. 256,north daija,de,30997-4476,Lawson_Lilliana_78792788275411915642,Lawson,Lilliana,78792788275411915642,North Daija,-5.6687886642665575,DE,36175 Amina Mount,Apt. 256,30997-4476

In [83]:
merged_df = pd.merge(csv_data, df1, on=['unique_id'])
print(merged_df.shape)
merged_df.head(2)

(864, 18)

,first_name,last_name,npi,street_x,street_2_x,city_x,state_x,zip_x,unique_id,doctor.first_name,doctor.last_name,doctor.npi,city_y,lat,state_y,street_y,street_2_y,zip_y
0,Marshall,Cole,18233577393219566041,59944 adaline harbor,apt. 862,keelingstad,al,94189-5965,Marshall_Cole_18233577393219566041,Marshall,Cole,18233577393219566041,Lake Sheila,67.8952178905721,AZ,729 Reuben Stream,Apt. 314,85355
1,Lawson,Lilliana,78792788275411915642,36175 amina mount,apt. 256,north daija,de,30997-4476,Lawson_Lilliana_78792788275411915642,Lawson,Lilliana,78792788275411915642,North Daija,-5.6687886642665575,DE,36175 Amina Mount,Apt. 256,30997-4476

In [66]:
csv_data.head()

,first_name,last_name,npi,street,street_2,city,state,zip
0,Ruthe,Laverne,44843147983186317848,569 glenda islands,suite 163,willport,nj,23453
1,Marshall,Cole,18233577393219566041,59944 adaline harbor,apt. 862,keelingstad,al,94189-5965
2,Lawson,Lilliana,78792788275411915642,36175 amina mount,apt. 256,north daija,de,30997-4476
3,Martine,Kiana,23583155472740817761,188 walsh flat,apt. 891,yasmeenstad,nv,83568
4,Leatha,Freida,NaN,43796 gutmann plains,suite 341,vonmouth,fl,10500

In [87]:
import json

In [ ]:
json.load()

In [86]:
with open('source_data.json', 'r+') as infile:
    for line in infile:
        print(line)
        for k, v in 
        break

{"doctor":{"first_name":"Dean","last_name":"Israel","npi":"85103080143784778415"},"practices":[{"street":"271 Annabelle Fort","street_2":"Apt. 404","zip":"53549","city":"Port Demetris","state":"LA","lat":"-79.8757664338564","lon":"84.31253504872467"}]}

In [ ]:
pd.DataFrame(json_data.doctor.tolist())